#tap 'homebrew/cask-fonts'
#tap 'homebrew/bundle'

brew 'zsh'
brew 'python3'
brew 'vim'
brew 'neovim'
brew 'llvm'
#brew 'deno'
brew 'pyright'
brew 'exa'
brew 'tree'
brew 'openssh'
brew 'htop'
brew 'git'
brew 'nvm'
brew 'wget'
brew 'fd'
brew 'tmux'
brew 'fzf'
brew 'autojump'
brew 'ripgrep'
brew 'zsh-vi-mode'
brew 'tree-sitter'

cask 'google-chrome'
cask 'visual-studio-code'
cask 'font-hack-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'wechat'
cask 'qq'
cask 'alacritty'
